Muhammed-Alessa/stm32-lab-projects/Project 58 - FreeRTOS - Three LED Tasks/main.c
/*
 * FreeRTOS - Three LED Tasks
 * Target: NUCLEO-F446RE / STM32F446RET6
 * Framework: STM32CubeF4 HAL
 *
 * Independently rewritten for the F446RE board.
 * This is not a copy of the book's program listing.
 */
#include "stm32f4xx_hal.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "cmsis_os2.h"


static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef osc = {0};
    RCC_ClkInitTypeDef clk = {0};

    __HAL_RCC_PWR_CLK_ENABLE();

    osc.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    osc.HSIState = RCC_HSI_ON;
    osc.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    osc.PLL.PLLState = RCC_PLL_NONE;
    if (HAL_RCC_OscConfig(&osc) != HAL_OK) {
        while (1) {}
    }

    clk.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                    RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clk.APB1CLKDivider = RCC_HCLK_DIV1;
    clk.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_0) != HAL_OK) {
        while (1) {}
    }
}

static void GPIO_Init_Project(void)
{
    GPIO_InitTypeDef g={0};__HAL_RCC_GPIOC_CLK_ENABLE();
    g.Pin=GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2;g.Mode=GPIO_MODE_OUTPUT_PP;g.Pull=GPIO_NOPULL;
    HAL_GPIO_Init(GPIOC,&g);
}
static void Slow(void*a){(void)a;for(;;){HAL_GPIO_TogglePin(GPIOC,GPIO_PIN_0);osDelay(1000);}}
static void Medium(void*a){(void)a;for(;;){HAL_GPIO_TogglePin(GPIOC,GPIO_PIN_1);osDelay(500);}}
static void Fast(void*a){(void)a;for(;;){HAL_GPIO_TogglePin(GPIOC,GPIO_PIN_2);osDelay(250);}}
int main(void)
{
    HAL_Init();SystemClock_Config();GPIO_Init_Project();
    osKernelInitialize();
    osThreadNew(Slow,NULL,NULL);osThreadNew(Medium,NULL,NULL);osThreadNew(Fast,NULL,NULL);
    osKernelStart();
    while(1){}
}
